{"id": "422fe199fe00e33aaa5b9dcc38075cc0", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "PRESS RELEASE June 9, 2025 Apple elevates the iPhone experience with iOS 26 The release delivers a stunning new design, powerful Apple Intelligence capabilities, new ways to stay connected in the Phone and Messages apps, and exciting updates to CarPlay, Apple Music, Maps, and Wallet iOS 26 is a major update that brings a beautiful new design, intelligent experiences, and improvements to the apps users rely on every day. CUPERTINO, CALIFORNIA Apple today previewed iOS 26 , a major update that brings a beautiful new design, intelligent experiences, and improvements to the apps users rely on every day. The new design provides a more expressive and delightful experience across the system while maintaining the instant familiarity of iOS. Integrated throughout the system and built with privacy from the ground up, Apple Intelligence gets even more capable. Updates to the Phone and Messages apps help users stay connected while eliminating distractions like unwanted calls. iOS 26 also introduces new features in CarPlay, Apple Music, Maps, and Wallet, as well as Apple Games, a brand-new app that gives players a single destination for all their games. “iOS 26 shines with the gorgeous new design and meaningful improvements to the features users rely on every day, making iPhone even more helpful,” said Craig Federighi, Apple’s senior vice president of Software Engineering. “Experiences are more expressive and personal, from the Lock Screen and Home Screen, to new capabilities across Phone and Messages that help users focus on the connections that matter most. And with powerful new Apple Intelligence capabilities integrated across the system, users can get things done easier than ever.” A Beautiful New Look The new design makes apps and system experiences more expressive and delightf", "source": "apple.com"}
{"id": "a9d79f00b872008d158761cdb78c5ad9", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": " and Messages that help users focus on the connections that matter most. And with powerful new Apple Intelligence capabilities integrated across the system, users can get things done easier than ever.” A Beautiful New Look The new design makes apps and system experiences more expressive and delightful, while keeping iOS instantly familiar. It’s crafted with Liquid Glass — a new translucent material that reflects and refracts its surroundings, bringing greater focus to content, and delivering a new level of vitality across controls, navigation, app icons, widgets, and more. The new design extends to the Home Screen and Lock Screen, making them more personal and expressive than ever. Liquid Glass also brings new customization options to app icons and widgets, including a stunning clear look. The new design extends to the Home Screen and Lock Screen, making them more personal and expressive than ever. Liquid Glass also brings new customization options to app icons and widgets, including a stunning clear look. On the Lock Screen, the time fluidly adapts to the available space in an image, and spatial scenes bring wallpapers to life with a 3D effect when users move iPhone. Updated design elements also deliver fresh experiences in apps. A simplified, streamlined Camera layout helps users keep their attention on the moment they’re capturing, and the Photos app is updated to feature separate tabs for Library and Collections views. In Safari, web pages flow from the top edge to the bottom of the screen, enabling users to see more of the page while maintaining access to frequently used actions like refresh and search. In Apple Music, News, and Podcasts, the tab bar is redesigned to float above users’ content, dynamically shrink when users are browsing to put content front and cen", "source": "apple.com"}
{"id": "94823f25b6893f870ca79279ba6c7e97", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ttom of the screen, enabling users to see more of the page while maintaining access to frequently used actions like refresh and search. In Apple Music, News, and Podcasts, the tab bar is redesigned to float above users’ content, dynamically shrink when users are browsing to put content front and center, and then expand when they scroll back up. An updated set of APIs provides developers with access to Liquid Glass materials and components so they can make their apps appear just as dynamic and delightful. New Capabilities Powered by Apple Intelligence Apple Intelligence elevates the iPhone experience and helps users get things done easier than ever, while unlocking new ways to communicate and do more with what’s on their screen. Live Translation is integrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. 1 Live Translation is enabled by Apple-built models that run entirely on device, so users’ personal conversations stay personal. Live Translation on FaceTime is shown on iPhone 16 Pro. Live Translation in Phone is shown on iPhone 16 Pro. Live Translation in Messages is shown on iPhone 16 Pro. Live Translation is integrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. Live Translation is integrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. Live Translation is integrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. previous next Building on Apple Intelligence, visual intelligence extends to a user’s iPhone screen so they can search and take action on anything they’re viewing across ap", "source": "apple.com"}
{"id": "c247899c5776462296fb28a8c4dcf484", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ntegrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. previous next Building on Apple Intelligence, visual intelligence extends to a user’s iPhone screen so they can search and take action on anything they’re viewing across apps. Users can ask ChatGPT questions about what they’re looking at onscreen to learn more, as well as search Google, Etsy, or other supported apps to find similar images and products. Visual intelligence also recognizes when a user is looking at an event and suggests adding it to their calendar, repopulating key details like date, time, and location. 2 Building on Apple Intelligence, visual intelligence now extends to a user’s iPhone screen, making it easy to search and take action across apps with anything they’re viewing. Genmoji and Image Playground provide users with even more ways to express themselves, including mixing their favorite emoji, Genmoji, and descriptions together to create something new. 3 Genmoji and Image Playground provide users with even more opportunities for self-expression, including mixing their favorite emoji, Genmoji, and descriptions together to create brand-new images. Shortcuts are now more powerful and intelligent than ever. Users can tap into intelligent actions, a whole new set of shortcuts enabled by Apple Intelligence, and will see dedicated actions for features like Writing Tools and Image Playground. Apple Intelligence can now automatically identify and summarize order tracking details from emails sent from merchants and delivery carriers, giving users the ability to see their full order details and progress notifications all in one place — even for purchases not made with Apple Pay. Additionally, a new Foundation Models framework opens up", "source": "apple.com"}
{"id": "c42d029bcf4c94673fa7501cc479abe4", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "tify and summarize order tracking details from emails sent from merchants and delivery carriers, giving users the ability to see their full order details and progress notifications all in one place — even for purchases not made with Apple Pay. Additionally, a new Foundation Models framework opens up access for any app to tap directly into the on-device foundation model at the core of Apple Intelligence, giving developers direct access to powerful intelligence that’s fast, built with privacy at its core, and available offline, using AI inference that is free of cost. Features for Staying Connected and Eliminating Interruptions Fundamental to the iPhone experience, the Phone app now offers a unified layout that combines Favorites, Recents, and Voicemails all in one place. Call Screening builds on Live Voicemail and helps eliminate interruptions by gathering information from the caller and giving users the details they need to decide if they want to pick up or ignore the call. 4 And for the times when a user is stuck on hold, Hold Assist notifies the user when a live agent is available. 5 The new Call Screening feature is shown on iPhone 16 Pro. The new Hold Assist feature is shown on iPhone 16 Pro. The new unified layout for the Phone app is shown on iPhone 16 Pro. Call Screening builds on Live Voicemail and helps eliminate interruptions by gathering information from the caller and giving users the details they need to decide if they want to pick up or ignore the call. For the times when a user is stuck on hold, Hold Assist notifies the user when a live agent is available. The Phone app now offers a unified layout that combines Favorites, Recents, and Voicemails all in one place. previous next In Messages, users can now screen messages from unknown senders, giving them mo", "source": "apple.com"}
{"id": "f590e19efdbc88acf77f4c9a7bd56fa2", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "times when a user is stuck on hold, Hold Assist notifies the user when a live agent is available. The Phone app now offers a unified layout that combines Favorites, Recents, and Voicemails all in one place. previous next In Messages, users can now screen messages from unknown senders, giving them more control over who appears in their conversation list. Messages from unknown senders will appear in a dedicated folder where users can then mark the number as known, ask for more information, or delete. These messages will remain silenced until a user accepts them. In Messages, users can now screen messages from unknown senders, giving them more control over who appears in their conversation list. iOS 26 also offers enhancements to conversations, including custom backgrounds and the ability to create polls. With Apple Intelligence, Messages can detect when a poll might come in handy and suggest one, and users can generate unique backgrounds that fit their conversation with Image Playground. Additionally, in group chats, users can now see typing indicators, and request, send, and receive Apple Cash. 6 In a group conversation in Messages, a user creates a poll for their friends to respond to. In a group conversation in Messages, a user gets a request to pay a friend using Apple Cash. A custom sky Background is shown behind a chat with a friend. A shadowy custom background is shown behind a group chat called Shred Heads. A custom background generated by Image Playground is shown behind a group chat called Buds. iOS 26 allows users to create polls in Messages. Users can now request, send, and receive Apple Cash in a group chat. iOS 26 offers enhancements to conversations like custom backgrounds. iOS 26 offers enhancements to conversations like custom backgrounds. Users can gener", "source": "apple.com"}
{"id": "35dd1e28e5746f1c239d8e4eeb7c8f2c", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "nd a group chat called Buds. iOS 26 allows users to create polls in Messages. Users can now request, send, and receive Apple Cash in a group chat. iOS 26 offers enhancements to conversations like custom backgrounds. iOS 26 offers enhancements to conversations like custom backgrounds. Users can generate unique backgrounds that fit their conversation with Image Playground. previous next Enhancements to CarPlay CarPlay — the smarter, safer way to use iPhone while driving — is used over 600 million times per day, and now with iOS 26, it receives updates that make it even more beautiful and easy to use. The stunning design includes a new compact view for incoming calls, allowing users to see who’s calling without missing key information like upcoming directions. iOS 26 also brings Tapbacks and pinned conversations to Messages in CarPlay, and with widgets and Live Activities, users can stay in the loop without losing focus on the road. These updates also come to CarPlay Ultra , which brings the best of iPhone and the best of the car together for a deeply integrated, unified experience across every screen. Light mode is shown in CarPlay. Dark mode is shown in CarPlay. Tapbacks in Messages are shown in CarPlay. Pinned conversations in Messages are shown in CarPlay. Widgets are shown in CarPlay. Live Activities are shown in CarPlay. The new CarPlay Ultra experience is shown. A close-up of the customizable CarPlay Ultra layout. Vehicle controls are shown in the new CarPlay Ultra experience. A car’s climate controls are shown in the new CarPlay experience. With iOS 26, the new design extends into the car for a consistent, expressive experience. With iOS 26, the new design extends into the car for a consistent, expressive experience. iOS 26 also brings Tapbacks to Messages in CarPl", "source": "apple.com"}
{"id": "f04e603c31163d1a08a56bef42c04ee2", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ence. A car’s climate controls are shown in the new CarPlay experience. With iOS 26, the new design extends into the car for a consistent, expressive experience. With iOS 26, the new design extends into the car for a consistent, expressive experience. iOS 26 also brings Tapbacks to Messages in CarPlay. Pinned conversations in Messages keep users connected while driving. iOS 26 brings widgets to CarPlay, enabling users to focus on the road. Live Activities in CarPlay help users stay on top of what’s important to them. CarPlay Ultra — which brings a unified and consistent experience across all the driver’s screens, and the ability to control vehicle functions like radio and climate — is now even more beautiful with the new design. CarPlay Ultra — which brings a unified and consistent experience across all the driver’s screens, and the ability to control vehicle functions like radio and climate — is now even more beautiful with the new design. CarPlay Ultra — which brings a unified and consistent experience across all the driver’s screens, and the ability to control vehicle functions like radio and climate — is now even more beautiful with the new design. CarPlay Ultra — which brings a unified and consistent experience across all the driver’s screens, and the ability to control vehicle functions like radio and climate — is now even more beautiful with the new design. previous next Updates to Apple Music, Maps, and Wallet In Apple Music, Lyrics Translation helps users understand the words to their favorite songs, while Lyrics Pronunciation allows everyone to sing along, regardless of language. AutoMix uses intelligence to transition from one song to the next like a DJ, using time stretching and beat matching to seamlessly move from one song to the next. The new Lyrics Trans", "source": "apple.com"}
{"id": "b5c11e7c6e01eb3797dd29806211735b", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "the words to their favorite songs, while Lyrics Pronunciation allows everyone to sing along, regardless of language. AutoMix uses intelligence to transition from one song to the next like a DJ, using time stretching and beat matching to seamlessly move from one song to the next. The new Lyrics Translation feature is shown in Apple Music on iPhone 16 Pro. The new Lyrics Pronunciation feature is shown in Apple Music on iPhone 16 Pro. In Apple Music, Lyrics Translation helps users understand the words to their favorite songs. Lyrics Pronunciation in the Apple Music app allows everyone to sing along. previous next In Apple Maps, Visited Places help users remember the places they’ve been. Users can choose to have iPhone detect when they’re at a place like a restaurant or shop, and view all of their Visited Places in Maps. Visited Places are protected with end-to-end encryption and cannot be accessed by Apple. Additionally, iPhone can now use on-device intelligence to better understand a user’s daily route, presenting them with their preferred route when they’re headed home or to the office, along with notifying them of delays and offering alternate routes. A user’s Visits are shown in Apple Maps on iPhone 16 Pro. A user’s preferred route to work is shown in Apple Maps on iPhone 16 Pro. In iOS 26, users can choose to have iPhone detect when they’re at a place like a restaurant or shop, and view all of their Visited Places in Maps. iPhone can now use on-device intelligence to better understand a user’s daily route, presenting them with their preferred route when they’re headed home or to the office, along with notifying them of delays and offering alternate routes. previous next Updates in Apple Wallet help make everyday interactions with the physical world easier than ever. U", "source": "apple.com"}
{"id": "268858f972be8792ca2352b790271b11", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": " understand a user’s daily route, presenting them with their preferred route when they’re headed home or to the office, along with notifying them of delays and offering alternate routes. previous next Updates in Apple Wallet help make everyday interactions with the physical world easier than ever. Users can choose to pay with installments or rewards when they make in-store purchases with Apple Pay using iPhone. Refreshed boarding passes in Wallet offer the ability to see and share Live Activities for real-time updates on a flight. They also provide convenient access to a traveler’s most relevant information, such as Maps to navigate airports, Find My to track important items and report missing bags, and more. In Apple Wallet on iPhone 16 Pro, a user’s boarding pass shows links to Maps and Find My. On iPhone 16 Pro, a user’s in-progress flight shows up on their Lock Screen as a Live Activity. On iPhone 16 Pro, the Maps app shows navigation inside LAX Terminal 3. On iPhone 16 Pro, the Find My app shows the location of a user’s luggage. In Apple Wallet, refreshed boarding passes offer the ability to see and share Live Activities for real-time updates on a flight. In Apple Wallet, refreshed boarding passes offer the ability to see and share Live Activities for real-time updates on a flight. Refreshed boarding passes in Apple Wallet also provide convenient access to a traveler’s most relevant information, such as Maps to navigate airports, Find My to track important items and report missing bags, and more. Refreshed boarding passes in Apple Wallet also provide convenient access to a traveler’s most relevant information, such as Maps to navigate airports, Find My to track important items and report missing bags, and more. previous next Additional features in iOS 26: Apple Gam", "source": "apple.com"}
{"id": "2cee27d229172de545890dcebd56727a", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "rt missing bags, and more. Refreshed boarding passes in Apple Wallet also provide convenient access to a traveler’s most relevant information, such as Maps to navigate airports, Find My to track important items and report missing bags, and more. previous next Additional features in iOS 26: Apple Games is a new app that gives players an all-in-one destination for their games. It helps players jump back into titles they love, find their next favorite, and have even more fun with friends. They’ll find out what’s happening across all their games, including major events and updates, so they never miss a moment. The Games app is also the best way to experience Apple Arcade, Apple’s game subscription service with more than 200 award-winning and highly rated games for the whole family. AirPods are more versatile than ever with new features for AirPods 4, AirPods 4 with Active Noise Cancellation (ANC), and AirPods Pro 2. Building on the benefits of Voice Isolation, studio-quality audio recording allows iPhone, iPad, and Mac users to record their content with great sound quality and enjoy even clearer calls. With camera remote, users can press and hold the AirPods stem to take a photo or start and stop a video recording on iPhone or iPad. Parents can now create or move kids into Child Accounts even more easily, taking advantage of a wide set of parental controls designed to keep children safe. Enhancements across Communication Limits, Communication Safety, and the App Store include parental approvals for contact requests from kids, blurring out sensitive content in FaceTime calls and photos in Shared Albums, and enabling parents to grant an exception for their child to download an app with an age rating that exceeds the app content restriction they set. Browsing in Safari gets ev", "source": "apple.com"}
{"id": "1fff5825050c5f4ec57a54362e90d293", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ental approvals for contact requests from kids, blurring out sensitive content in FaceTime calls and photos in Shared Albums, and enabling parents to grant an exception for their child to download an app with an age rating that exceeds the app content restriction they set. Browsing in Safari gets even more private with advanced fingerprinting protection extending to all browsing by default. Powerful accessibility features include Accessibility Reader, which provides a customized systemwide reading experience, and Braille Access, an all-new interface for iPhone devices with connected braille displays. Updates to Live Listen, Background Sounds, Personal Voice, and more bring a new level of accessibility across the Apple ecosystem. The new Apple Games app is shown on iPhone 16 Pro. The Child Accounts menu is shown on iPhone 16 Pro, with copy that reads, “Age-Appropriate Experiences in Apps.” Communication Limits are shown in a Messages conversation on iPhone 16 Pro. The new Apple Games app is a single destination for all of a player’s games, allowing them to jump back into titles they love, find their next favorite, and have even more fun with friends. Parents can now create or move kids into Child Accounts even more easily, taking advantage of a wide set of parental controls designed to keep children safe. Enhancements across Communication Limits include parental approvals for contact requests from kids, blurring out sensitive content in FaceTime calls and photos in Shared Albums. previous next Availability All of these features are available for testing starting today through the Apple Developer Program at developer.apple.com , and a public beta will be available through the Apple Beta Software Program next month at beta.apple.com . New software features will be availabl", "source": "apple.com"}
{"id": "c75543d2a4aa26c71875dd26e3a96bd1", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ms. previous next Availability All of these features are available for testing starting today through the Apple Developer Program at developer.apple.com , and a public beta will be available through the Apple Beta Software Program next month at beta.apple.com . New software features will be available this fall as a free software update for iPhone 11 and later. The Apple Intelligence features detailed require supported devices, which include all iPhone 16 models, iPhone 15 Pro, iPhone 15 Pro Max, iPad mini (A17 Pro), and iPad and Mac models with M1 and later that have Apple Intelligence enabled and Siri and device language set to the same supported language: English, French, German, Italian, Portuguese (Brazil), Spanish, Japanese, Korean, or Chinese (simplified). More languages will be coming by the end of this year: Danish, Dutch, Norwegian, Portuguese (Portugal), Swedish, Turkish, Chinese (traditional), and Vietnamese. For more information, visit apple.com/apple-intelligence . Features are subject to change. Some features may not be available in all languages or regions, and availability may vary due to local laws and regulations. For more information about availability, visit apple.com . Share article Media Text of this article June 9, 2025 PRESS RELEASE Apple elevates the iPhone experience with iOS 26 The release delivers a stunning new design, powerful Apple Intelligence capabilities, new ways to stay connected in the Phone and Messages apps, and exciting updates to CarPlay, Apple Music, Maps, and Wallet CUPERTINO, CALIFORNIA Apple today previewed iOS 26 , a major update that brings a beautiful new design, intelligent experiences, and improvements to the apps users rely on every day. The new design provides a more expressive and delightful experience across the syst", "source": "apple.com"}
{"id": "72e5ff8ca459fdf0206fafa89ed75663", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ay, Apple Music, Maps, and Wallet CUPERTINO, CALIFORNIA Apple today previewed iOS 26 , a major update that brings a beautiful new design, intelligent experiences, and improvements to the apps users rely on every day. The new design provides a more expressive and delightful experience across the system while maintaining the instant familiarity of iOS. Integrated throughout the system and built with privacy from the ground up, Apple Intelligence gets even more capable. Updates to the Phone and Messages apps help users stay connected while eliminating distractions like unwanted calls. iOS 26 also introduces new features in CarPlay, Apple Music, Maps, and Wallet, as well as Apple Games, a brand-new app that gives players a single destination for all their games. “iOS 26 shines with the gorgeous new design and meaningful improvements to the features users rely on every day, making iPhone even more helpful,” said Craig Federighi, Apple’s senior vice president of Software Engineering. “Experiences are more expressive and personal, from the Lock Screen and Home Screen, to new capabilities across Phone and Messages that help users focus on the connections that matter most. And with powerful new Apple Intelligence capabilities integrated across the system, users can get things done easier than ever.” A Beautiful New Look The new design makes apps and system experiences more expressive and delightful, while keeping iOS instantly familiar. It’s crafted with Liquid Glass — a new translucent material that reflects and refracts its surroundings, bringing greater focus to content, and delivering a new level of vitality across controls, navigation, app icons, widgets, and more. The new design extends to the Home Screen and Lock Screen, making them more personal and expressive than ever.", "source": "apple.com"}
{"id": "796af3fd45b1d62dd24661516f1f376e", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "nt material that reflects and refracts its surroundings, bringing greater focus to content, and delivering a new level of vitality across controls, navigation, app icons, widgets, and more. The new design extends to the Home Screen and Lock Screen, making them more personal and expressive than ever. Liquid Glass also brings new customization options to app icons and widgets, including a stunning clear look. On the Lock Screen, the time fluidly adapts to the available space in an image, and spatial scenes bring wallpapers to life with a 3D effect when users move iPhone. Updated design elements also deliver fresh experiences in apps. A simplified, streamlined Camera layout helps users keep their attention on the moment they’re capturing, and the Photos app is updated to feature separate tabs for Library and Collections views. In Safari, web pages flow from the top edge to the bottom of the screen, enabling users to see more of the page while maintaining access to frequently used actions like refresh and search. In Apple Music, News, and Podcasts, the tab bar is redesigned to float above users’ content, dynamically shrink when users are browsing to put content front and center, and then expand when they scroll back up. An updated set of APIs provides developers with access to Liquid Glass materials and components so they can make their apps appear just as dynamic and delightful. New Capabilities Powered by Apple Intelligence Apple Intelligence elevates the iPhone experience and helps users get things done easier than ever, while unlocking new ways to communicate and do more with what’s on their screen. Live Translation is integrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. 1 Live Translation is en", "source": "apple.com"}
{"id": "d95eaf675b29ac5b8c3c827bce7251e3", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "helps users get things done easier than ever, while unlocking new ways to communicate and do more with what’s on their screen. Live Translation is integrated into Messages, FaceTime, and Phone to help users communicate across languages, translating text and audio on the fly. 1 Live Translation is enabled by Apple-built models that run entirely on device, so users’ personal conversations stay personal. Building on Apple Intelligence, visual intelligence extends to a user’s iPhone screen so they can search and take action on anything they’re viewing across apps. Users can ask ChatGPT questions about what they’re looking at onscreen to learn more, as well as search Google, Etsy, or other supported apps to find similar images and products. Visual intelligence also recognizes when a user is looking at an event and suggests adding it to their calendar, repopulating key details like date, time, and location. 2 Genmoji and Image Playground provide users with even more ways to express themselves, including mixing their favorite emoji, Genmoji, and descriptions together to create something new. 3 Shortcuts are now more powerful and intelligent than ever. Users can tap into intelligent actions, a whole new set of shortcuts enabled by Apple Intelligence, and will see dedicated actions for features like Writing Tools and Image Playground. Apple Intelligence can now automatically identify and summarize order tracking details from emails sent from merchants and delivery carriers, giving users the ability to see their full order details and progress notifications all in one place — even for purchases not made with Apple Pay. Additionally, a new Foundation Models framework opens up access for any app to tap directly into the on-device foundation model at the core of Apple Intelligence, ", "source": "apple.com"}
{"id": "b088b57d37119e581b03c42b6bcae1ec", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "rs the ability to see their full order details and progress notifications all in one place — even for purchases not made with Apple Pay. Additionally, a new Foundation Models framework opens up access for any app to tap directly into the on-device foundation model at the core of Apple Intelligence, giving developers direct access to powerful intelligence that’s fast, built with privacy at its core, and available offline, using AI inference that is free of cost. Features for Staying Connected and Eliminating Interruptions Fundamental to the iPhone experience, the Phone app now offers a unified layout that combines Favorites, Recents, and Voicemails all in one place. Call Screening builds on Live Voicemail and helps eliminate interruptions by gathering information from the caller and giving users the details they need to decide if they want to pick up or ignore the call. 4 And for the times when a user is stuck on hold, Hold Assist notifies the user when a live agent is available. 5 In Messages, users can now screen messages from unknown senders, giving them more control over who appears in their conversation list. Messages from unknown senders will appear in a dedicated folder where users can then mark the number as known, ask for more information, or delete. These messages will remain silenced until a user accepts them. iOS 26 also offers enhancements to conversations, including custom backgrounds and the ability to create polls. With Apple Intelligence, Messages can detect when a poll might come in handy and suggest one, and users can generate unique backgrounds that fit their conversation with Image Playground. Additionally, in group chats, users can now see typing indicators, and request, send, and receive Apple Cash. 6 Enhancements to CarPlay CarPlay — the smarter, ", "source": "apple.com"}
{"id": "a5a54515f541dbc3f5fa1049947d86f2", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "hen a poll might come in handy and suggest one, and users can generate unique backgrounds that fit their conversation with Image Playground. Additionally, in group chats, users can now see typing indicators, and request, send, and receive Apple Cash. 6 Enhancements to CarPlay CarPlay — the smarter, safer way to use iPhone while driving — is used over 600 million times per day, and now with iOS 26, it receives updates that make it even more beautiful and easy to use. The stunning design includes a new compact view for incoming calls, allowing users to see who’s calling without missing key information like upcoming directions. iOS 26 also brings Tapbacks and pinned conversations to Messages in CarPlay, and with widgets and Live Activities, users can stay in the loop without losing focus on the road. These updates also come to CarPlay Ultra , which brings the best of iPhone and the best of the car together for a deeply integrated, unified experience across every screen. Updates to Apple Music, Maps, and Wallet In Apple Music, Lyrics Translation helps users understand the words to their favorite songs, while Lyrics Pronunciation allows everyone to sing along, regardless of language. AutoMix uses intelligence to transition from one song to the next like a DJ, using time stretching and beat matching to seamlessly move from one song to the next. In Apple Maps, Visited Places help users remember the places they’ve been. Users can choose to have iPhone detect when they’re at a place like a restaurant or shop, and view all of their Visited Places in Maps. Visited Places are protected with end-to-end encryption and cannot be accessed by Apple. Additionally, iPhone can now use on-device intelligence to better understand a user’s daily route, presenting them with their preferred rou", "source": "apple.com"}
{"id": "a150e23fe0b05fd779fe8f5c93ad7a85", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ike a restaurant or shop, and view all of their Visited Places in Maps. Visited Places are protected with end-to-end encryption and cannot be accessed by Apple. Additionally, iPhone can now use on-device intelligence to better understand a user’s daily route, presenting them with their preferred route when they’re headed home or to the office, along with notifying them of delays and offering alternate routes. Updates in Apple Wallet help make everyday interactions with the physical world easier than ever. Users can choose to pay with installments or rewards when they make in-store purchases with Apple Pay using iPhone. Refreshed boarding passes in Wallet offer the ability to see and share Live Activities for real-time updates on a flight. They also provide convenient access to a traveler’s most relevant information, such as Maps to navigate airports, Find My to track important items and report missing bags, and more. Additional features in iOS 26: Apple Games is a new app that gives players an all-in-one destination for their games. It helps players jump back into titles they love, find their next favorite, and have even more fun with friends. They’ll find out what’s happening across all their games, including major events and updates, so they never miss a moment. The Games app is also the best way to experience Apple Arcade, Apple’s game subscription service with more than 200 award-winning and highly rated games for the whole family. AirPods are more versatile than ever with new features for AirPods 4, AirPods 4 with Active Noise Cancellation (ANC), and AirPods Pro 2. Building on the benefits of Voice Isolation, studio-quality audio recording allows iPhone, iPad, and Mac users to record their content with great sound quality and enjoy even clearer calls. With camera r", "source": "apple.com"}
{"id": "af6c12a4ea08dff869c36c5e0b2f0823", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "h new features for AirPods 4, AirPods 4 with Active Noise Cancellation (ANC), and AirPods Pro 2. Building on the benefits of Voice Isolation, studio-quality audio recording allows iPhone, iPad, and Mac users to record their content with great sound quality and enjoy even clearer calls. With camera remote, users can press and hold the AirPods stem to take a photo or start and stop a video recording on iPhone or iPad. Parents can now create or move kids into Child Accounts even more easily, taking advantage of a wide set of parental controls designed to keep children safe. Enhancements across Communication Limits, Communication Safety, and the App Store include parental approvals for contact requests from kids, blurring out sensitive content in FaceTime calls and photos in Shared Albums, and enabling parents to grant an exception for their child to download an app with an age rating that exceeds the app content restriction they set. Browsing in Safari gets even more private with advanced fingerprinting protection extending to all browsing by default. Powerful accessibility features include Accessibility Reader, which provides a customized systemwide reading experience, and Braille Access, an all-new interface for iPhone devices with connected braille displays. Updates to Live Listen, Background Sounds, Personal Voice, and more bring a new level of accessibility across the Apple ecosystem. Availability All of these features are available for testing starting today through the Apple Developer Program at developer.apple.com , and a public beta will be available through the Apple Beta Software Program next month at beta.apple.com . New software features will be available this fall as a free software update for iPhone 11 and later. The Apple Intelligence features detailed requ", "source": "apple.com"}
{"id": "27ccb877e94c4f416c19068ceb83eeec", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "ple Developer Program at developer.apple.com , and a public beta will be available through the Apple Beta Software Program next month at beta.apple.com . New software features will be available this fall as a free software update for iPhone 11 and later. The Apple Intelligence features detailed require supported devices, which include all iPhone 16 models, iPhone 15 Pro, iPhone 15 Pro Max, iPad mini (A17 Pro), and iPad and Mac models with M1 and later that have Apple Intelligence enabled and Siri and device language set to the same supported language: English, French, German, Italian, Portuguese (Brazil), Spanish, Japanese, Korean, or Chinese (simplified). More languages will be coming by the end of this year: Danish, Dutch, Norwegian, Portuguese (Portugal), Swedish, Turkish, Chinese (traditional), and Vietnamese. For more information, visit apple.com/apple-intelligence . Features are subject to change. Some features may not be available in all languages or regions, and availability may vary due to local laws and regulations. For more information about availability, visit apple.com . About Apple Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Live Translation in Messages supports English (U.S., UK), French (France), German, Italian, Jap", "source": "apple.com"}
{"id": "006a9110fdb706b49aa22e5404311819", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "uding the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Live Translation in Messages supports English (U.S., UK), French (France), German, Italian, Japanese, Korean, Portuguese (Brazil), Spanish (Spain), and Chinese (simplified). Live Translation in Phone and FaceTime is available for one-on-one calls in English (U.S., UK), French (France), German, Portuguese (Brazil), and Spanish (Spain). The ability to add an event to a calendar with visual intelligence is available in English on all iPhone 16 models, iPhone 15 Pro, and iPhone 15 Pro Max. Genmoji and Image Playground are available in English, French, German, Italian, Portuguese (Brazil), Spanish, and Japanese. Call Screening supports Cantonese (China mainland, Hong Kong, Macao), English (U.S., Australia, Canada, India, Ireland, New Zealand, Puerto Rico, Singapore, South Africa, UK), French (Canada, France), German (Germany), Japanese (Japan), Korean (Korea), Mandarin Chinese (China mainland, Taiwan, Macao), Portuguese (Brazil), and Spanish (U.S., Mexico, Puerto Rico, Spain). Hold Assist supports English (U.S., Australia, Canada, India, Singapore, UK), French (France), Spanish (U.S., Mexico, Spain), German (Germany), Portuguese (Brazil), Japanese (Japan), and Mandarin Chinese (mainland China). Apple Cash services are provided by Green Dot Bank, Member FDIC. Apple Payments Services LLC, a subsidiary of Apple Inc., is a service provider of Green Dot Bank for Apple Cash accounts. Neither Apple Inc. nor Apple Payments Services LLC is a bank. Learn more about the terms and conditions. Only available in the U.S. on eligible devices. Press Contacts Shane Bauer Apple shanebauer@ap", "source": "apple.com"}
{"id": "bb9211753c24c32703f2ee779a7fa965", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "es LLC, a subsidiary of Apple Inc., is a service provider of Green Dot Bank for Apple Cash accounts. Neither Apple Inc. nor Apple Payments Services LLC is a bank. Learn more about the terms and conditions. Only available in the U.S. on eligible devices. Press Contacts Shane Bauer Apple shanebauer@apple.com Tania Olkhovaya Apple tolkhovaya@apple.com Apple Media Helpline media.help@apple.com Copy text Images in this article Download all images About Apple Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. Live Translation in Messages supports English (U.S., UK), French (France), German, Italian, Japanese, Korean, Portuguese (Brazil), Spanish (Spain), and Chinese (simplified). Live Translation in Phone and FaceTime is available for one-on-one calls in English (U.S., UK), French (France), German, Portuguese (Brazil), and Spanish (Spain). The ability to add an event to a calendar with visual intelligence is available in English on all iPhone 16 models, iPhone 15 Pro, and iPhone 15 Pro Max. Genmoji and Image Playground are available in English, French, German, Italian, Portuguese (Brazil), Spanish, and Japanese. Call Screening supports Cantonese (China mainland, Hong Kong, Macao), English (U.S., Australia, Canada, India, Ireland, New Zealand, Pu", "source": "apple.com"}
{"id": "3be2c3152d0925e3498647665dad16d5", "url": "https://www.apple.com/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/", "title": "Apple elevates the iPhone experience with iOS 26 - Apple", "date": "2025-08-15", "text": "s, iPhone 15 Pro, and iPhone 15 Pro Max. Genmoji and Image Playground are available in English, French, German, Italian, Portuguese (Brazil), Spanish, and Japanese. Call Screening supports Cantonese (China mainland, Hong Kong, Macao), English (U.S., Australia, Canada, India, Ireland, New Zealand, Puerto Rico, Singapore, South Africa, UK), French (Canada, France), German (Germany), Japanese (Japan), Korean (Korea), Mandarin Chinese (China mainland, Taiwan, Macao), Portuguese (Brazil), and Spanish (U.S., Mexico, Puerto Rico, Spain). Hold Assist supports English (U.S., Australia, Canada, India, Singapore, UK), French (France), Spanish (U.S., Mexico, Spain), German (Germany), Portuguese (Brazil), Japanese (Japan), and Mandarin Chinese (mainland China). Apple Cash services are provided by Green Dot Bank, Member FDIC. Apple Payments Services LLC, a subsidiary of Apple Inc., is a service provider of Green Dot Bank for Apple Cash accounts. Neither Apple Inc. nor Apple Payments Services LLC is a bank. Learn more about the terms and conditions. Only available in the U.S. on eligible devices. Press Contacts Shane Bauer Apple shanebauer@apple.com Tania Olkhovaya Apple tolkhovaya@apple.com Apple Media Helpline media.help@apple.com Latest News QUICK READ An update on Blood Oxygen for Apple Watch in the U.S. August 14, 2025 UPDATE Apple Arcade exclusive NFL Retro Bowl ’26 launching September 4 August 12, 2025 PRESS RELEASE Apple increases U.S. commitment to $600 billion, announces ambitious program August 6, 2025", "source": "apple.com"}
{"id": "c5cfeb0a0c041ef49ab48b713ed220a1", "url": "https://www.apple.com/os/ios/", "title": "OS - iOS 26 - Apple", "date": "2025-08-15", "text": "iOS 26 Preview New look. Even more magic. Coming this fall Get the highlights. Liquid Glass Visual Intelligence Polls in Messages Live Translation Manage unwanted calls Carplay interface A new design with Liquid Glass. Beautiful, delightful, and instantly familiar. Visual intelligence now lets you search, ask questions, and take action with the content on your iPhone screen. 1 Personalize chats with new backgrounds and answer questions with polls in Messages. Communicate across languages with Live Translation in Messages, 2 FaceTime, and Phone. 3 Eliminate distractions with new screening tools in Phone, 4 FaceTime, and Messages. Get more information at a glance with Live Activities and react with Tapbacks in CarPlay. 5 Design A whole new element of delight. The new design with Liquid Glass is beautiful, delightful, and instantly familiar. It gives you a more consistent experience across your apps and devices, making everything you do feel fluid. A fresh design. With the optical qualities of glass and a sense of fluidity, Liquid Glass brings an expressive new design to your Lock Screen, Home Screen, Control Center, apps, and more. A more vibrant Lock Screen. The time dynamically adapts to your photo wallpaper and notifications, keeping your subject in view. When you move your iPhone, your photo comes to life with a new 3D effect. 6 Updated app icons. Take your pick from updated light and dark appearances, new color-tinted icons, and a stunning clear look. Dynamic controls. Across apps, Liquid Glass controls reflect and refract their surroundings and fluidly morph to bring more focus to your content. A shared look across the system. Liquid Glass enables a more delightful experience across apps and devices so it’s easier to use your Apple products together as you move acro", "source": "apple.com"}
{"id": "e1f719b0e362c560fb5d962a8d17044e", "url": "https://www.apple.com/os/ios/", "title": "OS - iOS 26 - Apple", "date": "2025-08-15", "text": "oss apps, Liquid Glass controls reflect and refract their surroundings and fluidly morph to bring more focus to your content. A shared look across the system. Liquid Glass enables a more delightful experience across apps and devices so it’s easier to use your Apple products together as you move across them throughout your day. Apple Intelligence Effortlessly helpful every day. Apple Intelligence is integrated into even more places to help you communicate across languages, create more personal images, and use more powerful shortcuts. 7 Live Translation. Automatically translate texts in Messages, 2 display live translated captions in FaceTime, and get spoken translations for calls in the Phone app. 3 Do more with visual intelligence. It builds on Apple Intelligence, so you can search across your most used apps, add an event to your calendar, and ask questions — letting you do more with what’s on your screen. More ways to express yourself with images. Mix emoji and descriptions to make something brand-new. In Image Playground, discover additional ChatGPT styles. And have even more control when making images inspired by family and friends using Genmoji and Image Playground. 8 Accelerate your workflows. Intelligent actions in Shortcuts can summarize text, create images, or tap directly into Apple Intelligence models to provide responses that feed into your shortcut. Communication Less noise. More fun. Enjoy fewer interruptions and more ways to dial up the personality in your daily interactions — so you can focus on the conversations that matter most. Manage unwanted calls. Call Screening automatically answers unknown callers without interrupting you. Once the caller shares their name and the reason for their call, your phone rings and you can decide if you want to pick up. 4", "source": "apple.com"}
{"id": "2e90280a1730954063f29fde40ab4c80", "url": "https://www.apple.com/os/ios/", "title": "OS - iOS 26 - Apple", "date": "2025-08-15", "text": " interactions — so you can focus on the conversations that matter most. Manage unwanted calls. Call Screening automatically answers unknown callers without interrupting you. Once the caller shares their name and the reason for their call, your phone rings and you can decide if you want to pick up. 4 Screen new senders. Approve unknown numbers with new screening tools that detect spam and give you control over who appears in your conversations in Messages, and your recent calls in Phone and FaceTime. Let the Phone app wait on hold for you. Hold Assist keeps your spot in line while you wait for a live agent and notifies you when they’re ready. 9 Polls in Messages. Create a poll to let the group chat decide. Everyone in the conversation can contribute options and watch as votes come in. Add a background to any conversation. Select from stunning built-in options or choose any of your own photos to bring a distinct personality to your Messages conversations. Discovery Step into your comfort zone. On the spot. Tap into features that help you explore the world while protecting your privacy. And with the new Games app, stay up to date across all your games and discover new ones. Maps understands your preferred routes. Maps learns the routes you travel regularly and can alert you about significant delays, even before you head out. If your routine changes, iPhone adapts to it so you can conquer your commute. Visited Places in Maps. Never forget a place with the option to remember where you’ve been with Visited Places. Quickly find that great cafe from a trip and share it with a tap. 10 AutoMix and Lyrics Translation. AutoMix in Apple Music uses intelligence to seamlessly mix from one song to the next like a DJ, time stretching and beatmatching at the perfect moment. And Lyrics Tr", "source": "apple.com"}
{"id": "e5819601c8c39f38c3a8f581a3793a02", "url": "https://www.apple.com/os/ios/", "title": "OS - iOS 26 - Apple", "date": "2025-08-15", "text": " you’ve been with Visited Places. Quickly find that great cafe from a trip and share it with a tap. 10 AutoMix and Lyrics Translation. AutoMix in Apple Music uses intelligence to seamlessly mix from one song to the next like a DJ, time stretching and beatmatching at the perfect moment. And Lyrics Translation helps you understand the meaning behind your favorite songs. 11 Store even more in Wallet. Create a digital ID in Wallet using your U.S. passport. 12 It can be used at TSA checkpoints, in apps, and in person. Boarding passes now include convenient access to airport maps, luggage tracking with Find My, and shareable Live Activities. New Games app. Stay up to date with what’s happening across all your games, discover new ones your friends are playing, and get tailored recommendations. Compete with friends in score-based showdowns with Challenges. iOS 26 features And so much more. Accessibility. New features include an all-new experience designed with Braille 13 users in mind, more options for Vehicle Motion Cues to help reduce motion sickness, and a more customizable reading experience. Family. Parents can move kids to Child Accounts more easily and take advantage of a wide set of parental controls designed to keep children safe. These include enhancements across Communication Limits, Communication Safety, and the App Store. Audio recording. Capture high-quality audio during video conference calls. And record in high definition in Camera with AirPods and AirPods Pro with the H2 chip. Reminders. With Apple Intelligence, Reminders can suggest tasks, grocery items, and follow-ups based on emails or other text on your device. It can also automatically categorize related reminders into sections within a list. Photos. With an updated layout, easy-to-use controls, and Librar", "source": "apple.com"}
{"id": "28dab56e5773888944be29b26b29b24b", "url": "https://www.apple.com/os/ios/", "title": "OS - iOS 26 - Apple", "date": "2025-08-15", "text": "e H2 chip. Reminders. With Apple Intelligence, Reminders can suggest tasks, grocery items, and follow-ups based on emails or other text on your device. It can also automatically categorize related reminders into sections within a list. Photos. With an updated layout, easy-to-use controls, and Library and Collections as your two main tabs, Photos makes it easier than ever to find what you’re looking for. Bring your favorite photo to life as a spatial scene, which uses the same advanced technology as visionOS to create a captivating 3D effect. AirPods Camera Remote. Start recording video in Camera by pressing and holding on AirPods or AirPods Pro with the H2 chip. Clock. Set a snooze duration between 1 and 15 minutes, giving you more flexibility and customization for your daily alarms. CarPlay. React with a Tapback in Messages, follow Live Activities, and get more information at a glance so you can stay connected and focused while you drive. 5 Journal. Multiple journals let you keep entries for different aspects of your life separate, images can be added inline with text, and a beautiful map view shows entries based on their location. iOS 26 is compatible with these devices. Explore iPhone iPhone 16e iPhone 16 iPhone 16 Plus iPhone 16 Pro iPhone 16 Pro Max iPhone 15 iPhone 15 Plus iPhone 15 Pro iPhone 15 Pro Max iPhone 14 iPhone 14 Plus iPhone 14 Pro iPhone 14 Pro Max iPhone 13 iPhone 13 mini iPhone 13 Pro iPhone 13 Pro Max iPhone 12 iPhone 12 mini iPhone 12 Pro iPhone 12 Pro Max iPhone 11 iPhone 11 Pro iPhone 11 Pro Max iPhone SE (2nd generation and later) Developers will love iOS 26, too. Learn more about developing for iOS", "source": "apple.com"}
{"id": "2ff3d9809b027dc66de5bb1a0e550514", "url": "https://developer.apple.com/news/releases/", "title": "Releases - Apple Developer", "date": "2025-08-15", "text": "RSS iOS 26 beta 6 (23A5318c) August 11, 2025 View downloads View release notes iPadOS 26 beta 6 (23A5318c) August 11, 2025 View downloads View release notes macOS 26 beta 6 (25A5338b) August 11, 2025 View downloads View release notes tvOS 26 beta 6 (23J5339a) August 11, 2025 View downloads View release notes visionOS 26 beta 6 (23M5322b) August 11, 2025 View downloads View release notes watchOS 26 beta 6 (23R5340a) August 11, 2025 View downloads View release notes TestFlight Update August 6, 2025 View release notes Xcode 26 beta 5 (17A5295f) August 5, 2025 View downloads View release notes Transporter 1.3.4 August 1, 2025 Download the app View release notes iOS 18.6 (22G86) July 29, 2025 View downloads View release notes iPadOS 18.6 (22G86) July 29, 2025 View downloads View release notes macOS 15.6 (24G84) July 29, 2025 View downloads View release notes tvOS 18.6 (22M84) July 29, 2025 View downloads View release notes visionOS 2.6 (22O785) July 29, 2025 View downloads View release notes watchOS 11.6 (22U84) July 29, 2025 View downloads View release notes AirPods Firmware beta 4 (8A5324b) July 29, 2025 View installation instructions TestFlight Update July 22, 2025 View release notes iPadOS 17.7.9 RC (21H446) July 21, 2025 View downloads Icon Composer beta 3 July 8, 2025 Download the app App Store Connect 3.0 June 9, 2025 Download the app View release notes App Store Connect API 4.0 June 9, 2025 Download file View release notes Xcode 16.4 (16F6) May 28, 2025 View downloads View release notes iOS 18.5 (22F76) May 12, 2025 View downloads View release notes iPadOS 18.5 (22F76) May 12, 2025 View downloads View release notes macOS 15.5 (24F74) May 12, 2025 View downloads View release notes tvOS 18.5 (22L572) May 12, 2025 View downloads View release notes visionOS 2.5 (22O473) ", "source": "developer.apple.com"}
{"id": "26a77577c9f9ef9d97b9009fcfcf0a46", "url": "https://developer.apple.com/news/releases/", "title": "Releases - Apple Developer", "date": "2025-08-15", "text": " release notes iOS 18.5 (22F76) May 12, 2025 View downloads View release notes iPadOS 18.5 (22F76) May 12, 2025 View downloads View release notes macOS 15.5 (24F74) May 12, 2025 View downloads View release notes tvOS 18.5 (22L572) May 12, 2025 View downloads View release notes visionOS 2.5 (22O473) May 12, 2025 View downloads View release notes watchOS 11.5 (22T572) May 12, 2025 View downloads View release notes watchOS 11.4 (22T251) April 1, 2025 View downloads View release notes Xcode 16.3 (16E140) March 31, 2025 View downloads View release notes iOS 16.7.11 (20H360) March 31, 2025 View downloads iPadOS 16.7.11 (20H360) March 31, 2025 View downloads iOS 15.8.4 (19H390) March 31, 2025 View downloads iPadOS 15.8.4 (19H390) March 31, 2025 View downloads iPadOS 17.7.6 RC(21H423) March 24, 2025 View downloads App Store Connect 2.1 January 28, 2025 Download the app View release notes App Store Connect API 3.7 November 12, 2024 Download file View release notes", "source": "developer.apple.com"}
{"id": "d0c1c07ff77721c4cf859afecb047e8e", "url": "https://www.macrumors.com/2025/08/11/ios-26-beta-6-features/", "title": "Everything New in iOS 26 Beta 6 - MacRumors", "date": "2025/08/11", "text": "Everything New in iOS 26 Beta 6 Monday August 11, 2025 1:52 pm PDT by Juli Clover There's just about a month to go until Apple unveils new iPhones at its September event, and that means time is running out for Apple to perfect iOS 26 . We've reached a weekly beta update cadence, and Apple seeded ‌iOS 26‌ beta 6 to developers today. There are changes to Liquid Glass, tweaks to navigation, new ringtones, and more. Ringtones There are now several variants of the Reflection ringtone, including Buoyant, Dreamer, Tech, Pop, Reflected, and Surge. Reflected is the \"Alt 1\" Reflection ringtone that was added in the second beta of ‌iOS 26‌. There's also a new Little Bird ringtone. A 7th new ringtone, this one is a new original one called Little Bird pic.twitter.com/0O5bcIhwGf — Aaron (@aaronp613) August 11, 2025 Toggles Toggles now have a Liquid Glass effect when tapped. Lock Screen The Liquid Glass effect on the Lock Screen has been updated. The clock is more transparent than it was before, though it still has a frosted glass look. ‌iOS 26‌ beta 6 on left, beta 5 on right When entering a passcode, the passcode buttons are now more translucent than before. Navigation Bars Navigation bars in apps have been slightly updated to enhance translucency without impacting readability. Beta 6 on left, beta 5 on right In some places, there's more translucency, but in others, the background is more opaque so that text can still be read even if the background is busy. Beta 6 on left, beta 5 on right App Animations Apple changed the animation for opening and closing apps, and it's much faster than before so apps open more quickly. The animation has a very slight bounce to it, matching the bounce that's been added to the Lock Screen and Control Center. iOS 26 beta 6 brings new animations when op", "source": "macrumors.com"}
{"id": "f88031c38199549535ebf48be8e96e02", "url": "https://www.macrumors.com/2025/08/11/ios-26-beta-6-features/", "title": "Everything New in iOS 26 Beta 6 - MacRumors", "date": "2025/08/11", "text": " App Animations Apple changed the animation for opening and closing apps, and it's much faster than before so apps open more quickly. The animation has a very slight bounce to it, matching the bounce that's been added to the Lock Screen and Control Center. iOS 26 beta 6 brings new animations when opening and closing apps pic.twitter.com/u2BiXZDVTg — Aaron (@aaronp613) August 11, 2025 Camera Apple removed the toggle in the Camera app that allowed users to activate Classic Mode. Classic Mode reversed the scroll direction when switching from mode to mode in the app. Now Classic Mode is the default, and there's no option to return to the animation from earlier betas. The toggle was initially added in beta 5. Introductory Video When you update to ‌iOS 26‌, there's now an introductory video that walks you through the Liquid Glass design changes. iOS 26 beta 6 adds a new onboarding video. You can view it below (Text is shown on your device, this is the raw video file) pic.twitter.com/81dSbVmFwm — Aaron (@aaronp613) August 11, 2025 Preview App Apple changed the design of the Preview app, adding larger buttons for creating a new document and scanning a document. When scanning a document, the location of the buttons has also changed, and they're at the bottom of the interface rather than the top. Read More We have additional info on all of the new features in ‌iOS 26‌ in our dedicated iOS 26 roundup . Related Roundups: iOS 26 , iPadOS 26 Related Forum: iOS 26 [ 81 comments ]", "source": "macrumors.com"}
{"id": "fd0ffbf457a90423a73b5ccebf4cc871", "url": "https://www.macrumors.com/2025/08/14/apple-releases-ios-26-public-beta-3/", "title": "Apple Releases Third iOS 26 and iPadOS 26 Public Betas, New Developer Beta - MacRumors", "date": "2025/08/14", "text": "Apple Releases Third iOS 26 and iPadOS 26 Public Betas, New Developer Beta Thursday August 14, 2025 10:15 am PDT by Juli Clover Apple today released the third public betas of iOS 26 and iPadOS 26 , allowing the public to test the updates ahead of their September launch. The third public betas come a week after the second public betas. Apple has also released an updated version of the sixth ‌iOS 26‌ developer beta with a new build number. Beta testers that have registered on Apple's website can download the ‌iOS 26‌ and ‌iPadOS 26‌ updates by opening the Settings app, going to the General section, tapping on Software Update, and choosing the ‌iOS 26‌ or ‌iPadOS 26‌ Public Beta options. ‌iOS 26‌ and ‌iPadOS 26‌ feature Apple's Liquid Glass design, with a visual aesthetic that focuses on transparency. Icons, menu buttons, navigation bars, and more reflect and refract light with subtle animations. There are pop-out menus in some areas, tab bars shrink down, and everything has a more rounded look. There are new Apple Intelligence features like Visual Intelligence for screenshots, updated order tracking in the Wallet app, new features in Reminders, and Live Translation for the Messages, Phone, and FaceTime apps. Image Playground has ChatGPT style options, and Genmoji supports mixing two or more emoji characters to make something new. 2D photos have a more 3D look with a Spatial Scene feature, and Safari has updated navigation. In the Phone app, there are new Call Screening and Hold Assist features that will save you time, while the Messages app supports customizable backgrounds and polls. Apple Music has a DJ-like AutoMix feature, CarPlay has an overhauled interface, there's a new Apple Games app, and Preview has come to the iPhone for the first time. For more on all of the n", "source": "macrumors.com"}
{"id": "47b9b42fd4d75f2b23e9d8837bc41d4b", "url": "https://www.macrumors.com/2025/08/14/apple-releases-ios-26-public-beta-3/", "title": "Apple Releases Third iOS 26 and iPadOS 26 Public Betas, New Developer Beta - MacRumors", "date": "2025/08/14", "text": " Assist features that will save you time, while the Messages app supports customizable backgrounds and polls. Apple Music has a DJ-like AutoMix feature, CarPlay has an overhauled interface, there's a new Apple Games app, and Preview has come to the iPhone for the first time. For more on all of the new features in the updates, we have a dedicated iOS 26 roundup and a separate iPadOS 26 roundup . ‌iOS 26‌ and ‌iPadOS 26‌ will launch in September. [ 75 comments ]", "source": "macrumors.com"}
{"id": "8af3b8923d1ce0a4ce07a0012e9b0f6f", "url": "https://9to5mac.com/2025/08/14/apple-releases-new-ios-26-beta-6-build-for-developers/", "title": "Apple releases new iOS 26 beta 6 build for developers - 9to5Mac", "date": "2025/08/14", "text": "iOS 26 Apple releases new iOS 26 beta 6 build for developers Ryan Christoffel | Aug 14 2025 - 10:22 am PT 3 Comments Apple has released a new, revised build of iOS 26 beta 6 for developers. Here’s what you should know. iOS 26 beta 6 re-released with new developer build Earlier this week, Apple shipped iOS 26 beta 6 for developers. Curiously, that Monday release was never followed by a public beta—until today. Alongside today’s iOS 26 public beta 3 release , Apple has also shipped an updated beta for developers. That new beta carries the same ‘beta 6’ designation as Monday’s release. The prior beta 6 release had build number 23A5318c. Today’s new release from Apple is 23A5318f . Apple’s re-use of the ‘beta 6’ designation implies this update won’t include any user-facing new features or substantial changes. Rather, it likely addresses some bugs or security fixes that needed to be implemented before the public beta shipped. Personally, the last few days with iOS 26 beta 6 installed on my iPhone have been pretty solid. Performance has seemed better than ever. However, it’s always possible other users have been encountering larger problems. We may never know what sort of potential vulnerabilities or issues led Apple to release today’s updated build, but if you’re on the developer beta, it’s time for another update. We’ll keep you posted on any changes spotted in the new iOS 26 beta 6. Have you installed the new beta 6 build? Let us know if you discover anything different. Best iPhone accessories AirPods Pro 2 (now only $169, down from $249) MagSafe Car Mount for iPhone HomeKit smart plug 4-pack 10-year AirTag battery case 2-pack 100W USB-C fast charging power adapter Add 9to5Mac to your Google News feed. FTC: We use income earning auto affiliate links. More. You’re reading 9", "source": "9to5mac.com"}
{"id": "aca30fd5acf60f2fc05d6f26ae3e0516", "url": "https://9to5mac.com/2025/08/14/apple-releases-new-ios-26-beta-6-build-for-developers/", "title": "Apple releases new iOS 26 beta 6 build for developers - 9to5Mac", "date": "2025/08/14", "text": "one accessories AirPods Pro 2 (now only $169, down from $249) MagSafe Car Mount for iPhone HomeKit smart plug 4-pack 10-year AirTag battery case 2-pack 100W USB-C fast charging power adapter Add 9to5Mac to your Google News feed. FTC: We use income earning auto affiliate links. More. You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out our homepage for all the latest news, and follow 9to5Mac on Twitter , Facebook , and LinkedIn to stay in the loop. Don’t know where to start? Check out our exclusive stories , reviews , how-tos , and subscribe to our YouTube channel Featured from 9to5Mac 9to5Mac Logo Apple launching ‘redesigned Blood Oxygen feature’ on Apple Watch in the U.S. today Chance Miller Aug 14 2025 Apple Watch Ultra 3 could remedy this current ‘Ultra’ discrepancy Ryan Christoffel Aug 13 2025 iPhone 17 Pro could redefine Apple’s Pro color strategy Zac Hall Aug 14 2025 Faster animations on iOS 26 makes even older iPhones feel like new Benjamin Mayo Aug 14 2025 Check out 9to5Mac on YouTube for more Apple news: Comments Expand Close comments Expand Close comments Guides iOS 26 Author Ryan Christoffel iryantldr Ryan got his start in journalism as an Editor at MacStories, where he worked for four years covering Apple news, writing app reviews, and more. For two years he co-hosted the Adapt podcast on Relay FM, which focused entirely on the iPad. As a result, it should come as no surprise that his favorite Apple device is the iPad Pro.", "source": "9to5mac.com"}
{"id": "b1fecf9d149cce6881a0cdb694e105c1", "url": "https://9to5mac.com/2025/08/14/ios-26-ipados-26-public-beta-3/", "title": "iOS 26 and iPadOS 26 public beta 3 now available - 9to5Mac", "date": "2025/08/14", "text": "iOS 26 iPadOS 26 iOS 26 and iPadOS 26 public beta 3 now available Zac Hall | Aug 14 2025 - 10:14 am PT 3 Comments Following iOS 26 and iPadOS 26 beta 6, Apple has released the third iOS 26 and iPadOS 26 public betas. iOS 26 and iPadOS 26 public beta 3 For iPhone and iPad users on the public beta train, simply go to the Settings app > General section > Software Update to look for the over-the-air updates to iOS 26 and iPadOS 26 public beta 3. The third public beta release follows the sixth developer beta release of the pre-release software. Apple is expected to release the final versions of the iOS 26.0 and iPadOS 26.0 in September. We’ll likely see iOS 26.0.1 and maybe even an iOS 26.1 developer beta around the same time next month. iOS 26 public beta 3 should echo or resemble what we see in iOS 26 developer beta 6. See what’s new in the sixth developer beta releases here . The new public beta comes alongside an updated iOS 26 developer beta 6 build: 23A5318f. Curious about trying iOS 26 and iPadOS 26 public beta on your iPhone and iPad? You can go to beta.apple.com to sign up today. It’s free to sign up, and joining the public beta should automatically put the option to update in the Software Update section of the Settings app on your device. In-depth public beta previews For a recap of 9to5Mac’s public beta previews, check out these stories: iOS 26 public beta now available with new design and more iPadOS 26 public beta is here, and full of powerful new features macOS Tahoe 26 public beta now available, here’s everything new, install guide watchOS 26 public beta brings smarter workouts and app upgrades tvOS 26 public beta is now available, here’s all the new features for Apple TV HomePod 26 public beta launches with these new features Check out these great accessories", "source": "9to5mac.com"}
{"id": "ef798330d24204306dfd9be3e232fbe6", "url": "https://9to5mac.com/2025/08/14/ios-26-ipados-26-public-beta-3/", "title": "iOS 26 and iPadOS 26 public beta 3 now available - 9to5Mac", "date": "2025/08/14", "text": " 26 public beta now available, here’s everything new, install guide watchOS 26 public beta brings smarter workouts and app upgrades tvOS 26 public beta is now available, here’s all the new features for Apple TV HomePod 26 public beta launches with these new features Check out these great accessories Apple AirTag | Add Find My tracking to anything Beats USB-A to USB-C Cable | The official CarPlay cable Wireless CarPlay Adapter | No more plugging in required AirPods 4 | Apple’s most affordable AirPods with ANC Add 9to5Mac to your Google News feed. FTC: We use income earning auto affiliate links. More. You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out our homepage for all the latest news, and follow 9to5Mac on Twitter , Facebook , and LinkedIn to stay in the loop. Don’t know where to start? Check out our exclusive stories , reviews , how-tos , and subscribe to our YouTube channel Featured from 9to5Mac 9to5Mac Logo Apple Watch blood oxygen workaround arrives just in time Zac Hall Aug 14 2025 iOS 26 and iPadOS 26 public beta 3 now available Zac Hall Aug 14 2025 iPhone 17 release date: Here’s when to expect Apple’s big launch Ryan Christoffel Aug 14 2025 Apple trained an LLM to teach itself good UI code in SwiftUI Marcus Mendes Aug 14 2025 Check out 9to5Mac on YouTube for more Apple news: Comments Expand Close comments Expand Close comments Guides iOS 26 iPadOS 26 Author Zac Hall apollozac Zac covers Apple news, hosts the 9to5Mac Happy Hour podcast, and created SpaceExplored.com.", "source": "9to5mac.com"}
{"id": "3c5554afef3eefa94402b3662bed9cc4", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "Phones iPhones iOS 26 guide: All the new features for your iPhone and how to use them News By Philip Michaels published 26 July 2025 Everything you need to know about Apple's latest iPhone software Comments (0) ( ) When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works . (Image credit: Tom's Guide / Shutterstock / Apple) Jump to: How to download iOS 26 Liquid Glass Phone and FaceTime Messages Camera Photos Visual Intelligence Shortcuts and Reminders Maps Games CarPlay Other features Outlook Any iOS update is going to have its share of unfamiliar features with new twists and turns that you may not immediately grasp. Apple's iOS 26 update is a case in point, as this year's version of the iPhone software rolls out new capabilities and enhancements to old features while also switching up the interface for the first time in a dozen years. For the most part, these are positive changes, as I observe in my iOS 26 first look , but they will take some getting used to. Fortunately, we've been working with iOS 26 since Apple released the initial developer beta in June, and we can help you get the lay of the land. In this iOS 26 guide, I'll walk you through the biggest changes in Apple's software update, now available as a public beta ahead of its full release in the fall. You may like iOS 26 public beta LIVE — new iPhone features to try, how to download and latest news 7 iOS 26 features I can't wait to try on my iPhone iOS 26 announced — here's all the new features for your iPhone This guide features highlights of the major iOS 26 changes as well as links back to our coverage for a more in-depth explanation of what's new in the update and how to make the most of it. iOS 26: How to download the update (Image credit: Tom's Guide / John V", "source": "tomsguide.com"}
{"id": "6cc09d41f5b6d7b4c798710bb3e51ced", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "e's all the new features for your iPhone This guide features highlights of the major iOS 26 changes as well as links back to our coverage for a more in-depth explanation of what's new in the update and how to make the most of it. iOS 26: How to download the update (Image credit: Tom's Guide / John Velasco) Our guide on how to download the iOS 26 public beta offers step-by-step instructions on updating your iPhone's software. You'll need to enroll in Apple's beta software program, and then it's just a matter of going into the Software Update section of the Settings app to grab the iOS 26 beta. Just make sure you've got an iOS 26 supported device capable of running the update. That's any iPhone released from 2019 onward — basically, the iPhone 11 or later. That means the iPhone XR, iPhone XS and iPhone XS Max are the only iOS 18-compatible devices that can't upgrade to iOS 26. (And no, you didn't fall asleep and miss eight iOS updates between iOS 18 and iOS 26. Apple decided to switch to a different naming convention for its software, replacing the version number with the year following the update's release.) Sign up to get the BEST of Tom's Guide direct to your inbox. Get instant access to breaking news, the hottest reviews, great deals and helpful tips. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors By submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over. Also, be aware that not every feature will work on every iOS 26-compatible phone. There are Apple Intelligence features in iOS 26 that require at least an iPhone 15 Pro or later. A new spatial photos feature only works on the iPhone 12 later. iOS 26 and Liquid Glass (Image credit: Future) ", "source": "tomsguide.com"}
{"id": "5618cfed61b4050a9d880651206f1c23", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": " or over. Also, be aware that not every feature will work on every iOS 26-compatible phone. There are Apple Intelligence features in iOS 26 that require at least an iPhone 15 Pro or later. A new spatial photos feature only works on the iPhone 12 later. iOS 26 and Liquid Glass (Image credit: Future) Liquid Glass is the name Apple's given to the new interface for its iPhone software, as well as for the software updates coming to the Mac, iPad, Apple Watch and Apple TV this year. Apple wants a more unified software experience with streamlined menus with a look that takes its inspiration from the visionOS software that powers the Vision Pro headset. Liquid Glass is characterized by translucent menus and fluid animations as on-screen elements adjust to your actions. (Think the URL bar shrinking in Safari as you scroll down a web page.) Some icons have been changed around in iOS 26, and you've got new tinting options, including one that makes those icons completely clear. We've got a comparison between the iOS 26 and iOS 18 interfaces that can help you get used to what's changing with the look of Apple's iPhone software. And if you find the translucent look distracting, we can show you how to adjust the transparency of interface elements in Settings. (Image credit: Future) As part of iOS 26's interface changes, your iPhone lock screen can take on a new look with spatial photos available as the background image for your phone and an adaptive time feature that adjusts the look of the on-screen clock to fit with the other visual elements. We go through all the iOS 26 lock screen changes . iOS 26 Phone and FaceTime app (Image credit: Future) The Phone app gets a unified interface that combines your recents and missed calls into a single window. (You can switch back to the old loo", "source": "tomsguide.com"}
{"id": "1f57f378b1931a42e5d9fb19ec55707a", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": " on-screen clock to fit with the other visual elements. We go through all the iOS 26 lock screen changes . iOS 26 Phone and FaceTime app (Image credit: Future) The Phone app gets a unified interface that combines your recents and missed calls into a single window. (You can switch back to the old look if you prefer.) But the biggest additions are call screening and hold assist, and they're available on any phone capable of running iOS 26. Call screening fields incoming calls from unknown numbers, having those callers identify themselves and why they're calling. That information appears on your iPhone screen, letting you decide whether to take the call. We've got a look at how the iPhone's call screening compares to what the Google Pixel offers . Hold Assist does exactly what its name implies — it will monitor the phone line when you're put on hold, freeing you up to do other things. When a live agent comes on the line, you'll get a notification. Here are more details on how call screening and Hold Assist work in iOS 26 . FaceTime gets a new look, too, with a tiled interface that shows off contact posters of the people you've talked to. There are call screening features here as well. (Image credit: Future) Meanwhile, phones that support Apple Intelligence get a big boost to both the Phone and FaceTime apps — live translations so that you can carry on a conversation with a person in another language. Only select languages are supported right now, and you'll need to download the appropriate language from the Translate app for the feature to work seamlessly. iOS 26 Messages (Image credit: Future) Of the current apps on your iPhone, Messages sees the highest volume of changes, and we detail everything that's new in iOS 26 Messages . But here are the highlights of what you'll ", "source": "tomsguide.com"}
{"id": "a594d7f0f50ca7b9d04379a738f5ff4d", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "appropriate language from the Translate app for the feature to work seamlessly. iOS 26 Messages (Image credit: Future) Of the current apps on your iPhone, Messages sees the highest volume of changes, and we detail everything that's new in iOS 26 Messages . But here are the highlights of what you'll see after updating. Group chats pick up a lot of new features, such as typing indicators and the ability to send Apple Cash to groups. Group chats are also the biggest beneficiary of a new polling feature that lets you put polls into chats so that people can vote for their favorite option. From an aesthetic standpoint, you can now use wallpapers as the background for your chat screens — each conversation can have its own background. And like Phone and FaceTime, Messages gains a way to screen out texts from unknown senders, just by adjusting one of the app's settings. iOS 26 Camera (Image credit: Future) Streamlined controls are a theme throughout iOS 26, but that's the most evident in the Camera app. Launch your camera, and you'll see just two controls for video and photo. Swiping left or right brings up other camera modes, such as portrait, pano, slo-mo and time lapse. An upward swipe brings additional settings to adjust things like aspect ratio, exposure and more. And in video mode, you just need to tap the Format button to bring up all your available options. My colleague John Velasco has more on the streamlined camera interface and how it simplifies the task of adjusting settings. He also looks at new iOS 26 AirPod features that turn your earbuds into camera remotes and recording tools. iOS 26 Photos (Image credit: Future) After a big Photos overhaul in iOS 18, Apple is at it again with iOS 26, though this time the changes are more modest. The new version of Photos restor", "source": "tomsguide.com"}
{"id": "5a60b4d212adb343109462538d97315c", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "gs. He also looks at new iOS 26 AirPod features that turn your earbuds into camera remotes and recording tools. iOS 26 Photos (Image credit: Future) After a big Photos overhaul in iOS 18, Apple is at it again with iOS 26, though this time the changes are more modest. The new version of Photos restores tabs for toggling between your library and your collections, an addition that should save some scrolling while addressing complaints about last year's redesign. That's not the only change to Photos' look, though. You also have the ability to customize the layout of Collections. And if you have an iPhone 12 or later, you can turn images in your library into spatial photos that offer depth effects. (A bonus: if you've got a photo widget on your home screen to serve up favorite photos at random, they'll be automatically converted to spatial images.) See our guide to the biggest changes in iOS 26 Photos for more details. iOS 26 Visual Intelligence (Image credit: Future) iPhones that support Apple Intelligence will benefit from expanded Visual Intelligence features in iOS 26. Specifically, the update adds the ability for the AI-powered tool to look at the contents of your iPhone screen via a screenshot. When you take a screenshot on a supported phone, you'll get on-screen options for searching with Google or ChatGPT. You'll also have contextually relevant commands like translation tools or creating calendar events. And you can highlight specific areas of the screenshot for searching, similar to Android's Circle to Search feature. I spent some hands-on time with Visual Intelligence in iOS 26 if you want to see examples of what the new capabilities allow you to do. iOS 26 Shortcuts and Reminders (Image credit: Apple) One of Apple's goals with iOS 26 has been to work Apple Intelli", "source": "tomsguide.com"}
{"id": "e9307e104e24e555b13b46037fdb374c", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": " similar to Android's Circle to Search feature. I spent some hands-on time with Visual Intelligence in iOS 26 if you want to see examples of what the new capabilities allow you to do. iOS 26 Shortcuts and Reminders (Image credit: Apple) One of Apple's goals with iOS 26 has been to work Apple Intelligence into more of the iPhone's built-in apps. That's evident in the new versions of Shortcuts and Reminders, both of which now support some of Apple's AI features. In Shortcuts, you can now create workflows that tap into Apple Intelligence features like Writing Tools or Image Playground. For example, you could now make a shortcut that summarize text, pasting that summary into a document. Apple Intelligence support also extends to Apple Intelligence's on-device models and ChatGPT. We've got a look at what Shortcuts' integration with Apple Intelligence means for you . As for Reminders, the app can now look at text in emails and on websites to find and create relevant tasks. It also works with recipes in the Apple News Plus service to automatically create grocery lists. And reminders can now be automatically categorized in a list thanks to Apple Intelligence integration. Apple Maps (Image credit: Future) The first time you launch the iOS 26 Maps app, you'll be asked if you want the app to log all the places you visit. The idea behind this Visited Places feature is that it will help you remember favorite locations for later reference without any additional action on your part. I took a look at why Visited Places figures to be a great addition in iOS 26 Maps . Another new Maps feature takes note of your preferred routes for frequent trips like commutes, school drop-offs and errands, showing you a preview of that route in a Maps widget. There are also notification alerts when ther", "source": "tomsguide.com"}
{"id": "d0c7ffb6cf8a508898c347a5c1f23eab", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "a look at why Visited Places figures to be a great addition in iOS 26 Maps . Another new Maps feature takes note of your preferred routes for frequent trips like commutes, school drop-offs and errands, showing you a preview of that route in a Maps widget. There are also notification alerts when there's likely to be a delay on that route so you can look for an alternative way of getting to Point B. iOS 26 Games (Image credit: Future) iOS 26 adds a couple of new apps — Preview, which is an iPhone addition of the PDF viewing app on your Mac, and Games , which is entirely new. Apple treats Games like a one-stop shop for all the games installed on your iPhone, and indeed every game you've ever tried. You can launch games directly from the app or re-download them from the App Store if you've discovered something you haven't played in a while. You'll find recommendations, especially from the Apple Arcade subscription service. The true value of the Games app may not emerge until the fall when app makers starting releasing their iOS 26-inspired updates. There's a Play Together tab in which you can challenge friends to see who can post a better score in specific games, and there's clearly a push for app to add challenges that you'll be able to access from the Games app. iOS 26 CarPlay (Image credit: Tom's Guide / John Velasco) Liquid Glass also comes to CarPlay in iOS 26, but our CarPlay hands-on found the most welcome changes to be the addition of widgets and the ability to respond to text messages with tapbacks. Both of those features let you glance at information and respond quickly without distracting you from your drive. Other iOS 26 features (Image credit: Future) By now, you've probably surmised that there's a lot to this iOS 26 update. Here's a quick round-up of other fea", "source": "tomsguide.com"}
{"id": "d4b216633c0592aac9bda8914196cde4", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": " text messages with tapbacks. Both of those features let you glance at information and respond quickly without distracting you from your drive. Other iOS 26 features (Image credit: Future) By now, you've probably surmised that there's a lot to this iOS 26 update. Here's a quick round-up of other features and additions you should be aware of as you try out the public beta. iOS 26 Safari gets a redesign toolbar, though you have some control over how that redesign looks. iOS 26 Music adds an AutoMix feature for Apple Music subscribers, and anyone can now pin their favorite songs, albums. artists and playlists to the top of the app's Library tab. iOS 26 Wallet will let you create a digital passport that you can use as ID at TSA checkpoints for domestic flights, though this feature isn't available in the iOS 26 public beta. Genmoji and Image Playground both gain new features, as you can now combine two emoji to make a new one or add expressions to the genmoji of people. Expressions are also available in Image Playground which gains access to ChatGPT for more images styles. iOS 26 outlook The iOS 26 public beta released on July 24 is just the first of what figures to be many versions rolled out during the summer. Check back with this guide, which we'll update as Apple adds more features and we get the chance to put them to the test. More from Tom's Guide iOS 26: The game-changing features 5 iOS 26 settings to change right away Helpful gesture controls for your iPhone Today's best Apple iPhone 16 and Apple iPhone 16 Pro deals $23.06 View $59.95 View $829 View Show more We check over 250 million products every day for the best prices See more Phones News Philip Michaels Philip Michaels is a Managing Editor at Tom's Guide. He's been covering personal technology since 1999 and wa", "source": "tomsguide.com"}
{"id": "760e9a6dbebf68981ef426a6e9299572", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "pple iPhone 16 and Apple iPhone 16 Pro deals $23.06 View $59.95 View $829 View Show more We check over 250 million products every day for the best prices See more Phones News Philip Michaels Philip Michaels is a Managing Editor at Tom's Guide. He's been covering personal technology since 1999 and was in the building when Steve Jobs showed off the iPhone for the first time. He's been evaluating smartphones since that first iPhone debuted in 2007, and he's been following phone carriers and smartphone plans since 2015. He has strong opinions about Apple, the Oakland Athletics, old movies and proper butchery techniques. Follow him at @PhilipMichaels. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name. Logout Read more iOS 26 public beta LIVE — new iPhone features to try, how to download and latest news 7 iOS 26 features I can't wait to try on my iPhone iOS 26 announced — here's all the new features for your iPhone I've been testing iOS 26 for a month — 5 tips you need to know now that the public beta is here I just spent my first 48 hours with iOS 26 — here's what happened 11 best hidden iOS 26 features — here's my favorites so far Latest in iPhones iPhone 17 Pro Max vs iPhone 16 Pro Max: Biggest rumored upgrades Right now is the worst time to buy a new iPhone — here’s why iPhone 17 Air tipped to make 3 big compromises vs iPhone 17 Pro — here’s what you’re giving up I've tried out the biggest addition to iOS 26 Maps — here's what I like and what I don't Forget the iPhone 17 — next year's iPhone 18 due for huge performance boost New Siri will reportedly let you voice control your iPhone apps — this could change everything Latest in News DirecTV's free streaming service is adding", "source": "tomsguide.com"}
{"id": "c48a2c156a602fc6e76a4c1d05f27cb8", "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide", "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide", "date": "2025-07-26", "text": "e biggest addition to iOS 26 Maps — here's what I like and what I don't Forget the iPhone 17 — next year's iPhone 18 due for huge performance boost New Siri will reportedly let you voice control your iPhone apps — this could change everything Latest in News DirecTV's free streaming service is adding 9 new channels this month - here's what to watch Booking.com phishing scam is infecting users with malware by using lookalike URLs — don't fall for this Netflix's massive app redesign is rolling out to Apple TV 4K now — here's what's new Samsung Galaxy S26 Edge: All the rumors so far Sam Altman's bold prediction: Gen Alpha grads could skip the cubicle and head right for high-paying jobs in space Claude’s new ‘learning modes’ take on ChatGPT’s Study Mode — here’s what they do LATEST ARTICLES 1 How to stop your upstairs feeling like an oven: an expert shares the simple trick that will push cool air upwards 2 Personal trainer recommends the one arm plank as the perfect way to upgrade your core workouts — I gave it a try 3 Google’s new Genie 3 could be a watershed moment for AI and gaming — here’s why 4 What is ChatGPT-5? — new features, how to use it, plans, pricing and more 5 Netflix just dropped an intense new thriller with a 'Fantastic Four' star that you shouldn't skip", "source": "tomsguide.com"}
